ka2_2024/src/DataProcessors/ИнтеграцияУправлениеПерсоналом/ИнтеграцияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияУправлениеПерсоналом</name>
</mdclass:DataProcessor>

ka2_2024/src/InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/НастройкиИнтеграцииКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииКабинетСотрудника</name>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииМобильныйТелефон</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидКонтактнойИнформацииАдресЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяКадровыйЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДнейСохраненияПубликации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПубликоватьСтруктуруЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОбсуждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧатБот</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>КоординаторОбсуждений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПриложенияСовместногоИспользования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПолученияСогласияНаПрисоединениеККЭДО</name>
    <type>
      <types>EnumRef.СпособыПолученияСогласияНаПрисоединениеККЭДО</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛисток</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьРасчетныеЛистыОтдельнымЗапросом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/НастройкиИнтеграцииУправлениеПерсоналом/НастройкиИнтеграцииУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииУправлениеПерсоналом</name>
  <resources>
    <name>ВидКИМобильныйТелефон</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ВидКИАдресЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ПубликоватьСтруктуруЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ka2_2024/src/Enums/ПриложенияДляИнтеграции/ПриложенияДляИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПриложенияДляИнтеграции</name>
  <enumValues>
    <name>УправлениеПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>КабинетСотрудника</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/DataProcessors/ИнтеграцияУправлениеПерсоналом/Forms/ПубликуемыеФизическиеЛица/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.ТолькоОшибкиЗаполнения Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "БлокирующаяОшибка", Истина);
	КонецЕсли;
	
	Если Параметры.Приложение = Перечисления.ПриложенияДляИнтеграции.УправлениеПерсоналом Тогда
		ЗаголовокФормы = НСтр("ru = 'Выгружаемые физические лица'");
		Список.Параметры.УстановитьЗначениеПараметра("ОкончаниеВыгрузки", ТекущаяДатаСеанса());
		Список.Параметры.УстановитьЗначениеПараметра("ДнейСохраненияПубликации", 0);
		Элементы.СписокОкончаниеВыгрузки.Видимость = Ложь;
	Иначе
		
		ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ВыгружаемыеОбъекты1СПерсонал", "ВыгружаемыеОбъектыКабинетСотрудника");
		Список.ТекстЗапроса = ТекстЗапроса;
		
		Настройки = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.НастройкиИнтеграции();
		Список.Параметры.УстановитьЗначениеПараметра("ОкончаниеВыгрузки",		ТекущаяДатаСеанса() - Настройки.ДнейСохраненияПубликации * 86400);
		Список.Параметры.УстановитьЗначениеПараметра("ДнейСохраненияПубликации",Настройки.ДнейСохраненияПубликации);
		
		Если Параметры.ТолькоОшибкиЗаполнения Тогда
			ЗаголовокФормы = НСтр("ru = 'Публикуемые кабинеты сотрудников с ошибками заполнения'");
		Иначе
			ЗаголовокФормы = НСтр("ru = 'Публикуемые кабинеты сотрудников'");
		КонецЕсли; 
		
	КонецЕсли;
	Заголовок = ЗаголовокФормы;
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииУправлениеПерсоналом.Настройки();
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИАдресПочты", 		Настройки.ВидКИАдресЭлектроннойПочты);
	Список.Параметры.УстановитьЗначениеПараметра("ВидКИМобильныйТелефон",	Настройки.ВидКИМобильныйТелефон);
	Список.Параметры.УстановитьЗначениеПараметра("Приложение", 				Параметры.Приложение);
	
КонецПроцедуры

#КонецОбласти
